I have cleared the .terraform folder in the folder where I run the code. I am still not able to provision the server with the Binary you have given.

Terraform plugin folder
```
ankit-gupta@ankit-gupta:~$ ls ~/.terraform.d/plugins/
terraform-provider-ibm_v1.22.1

ankit-gupta@ankit-gupta:~$ ~/.terraform.d/plugins/terraform-provider-ibm_v1.22.1 
2021/04/01 18:42:31 IBM Cloud Provider version 1.22.0  
This binary is a plugin. These are not meant to be executed directly.
Please execute the program that consumes these plugins, which will
load any plugins automatically
```

Terraform code

```
terraform {
  backend "gcs" {
    bucket = "xxxxxxx"
    prefix  = "xxxxxxx"
  }
}



resource "ibm_compute_vm_instance" "virtual_server" {
  hostname = "poc-n1"
  domain = "xxxxxxx"
  ssh_key_ids = [
    "xxxxxxx",
    "xxxxxxx",
    "xxxxxxx"
  ]
  public_security_group_ids = ["xxxxxxx","xxxxxxx","xxxxxxx"]
  private_vlan_id = "xxxxxxx"
  public_vlan_id = "xxxxxxx"
  quote_id = xxxxxxx
  datacenter = "sng01"
}

```
Respose 
```
ankit-gupta@ankit-gupta:~/xxxxxxx/poc$ terraform-v0.12.30 apply
Acquiring state lock. This may take a few moments...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_compute_vm_instance.virtual_server will be created
  + resource "ibm_compute_vm_instance" "virtual_server" {
      + block_storage_ids          = (known after apply)
      + cores                      = (known after apply)
      + datacenter                 = "sng01"
      + disks                      = (known after apply)
      + domain                     = "xxxxxxx"
      + file_storage_ids           = (known after apply)
      + flavor_key_name            = (known after apply)
      + hostname                   = "poc-n1"
      + hourly_billing             = true
      + id                         = (known after apply)
      + ip_address_id              = (known after apply)
      + ip_address_id_private      = (known after apply)
      + ipv4_address               = (known after apply)
      + ipv4_address_private       = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_address_id            = (known after apply)
      + ipv6_enabled               = false
      + ipv6_static_enabled        = false
      + local_disk                 = true
      + memory                     = (known after apply)
      + network_speed              = 100
      + private_interface_id       = (known after apply)
      + private_network_only       = false
      + private_security_group_ids = (known after apply)
      + private_subnet             = (known after apply)
      + private_subnet_id          = (known after apply)
      + private_vlan_id            = xxxxxxx
      + public_bandwidth_limited   = (known after apply)
      + public_bandwidth_unlimited = false
      + public_interface_id        = (known after apply)
      + public_ipv6_subnet         = (known after apply)
      + public_ipv6_subnet_id      = (known after apply)
      + public_security_group_ids  = [
          + xxxxxxx,
          + xxxxxxx,
          + xxxxxxx,
        ]
      + public_subnet              = (known after apply)
      + public_subnet_id           = (known after apply)
      + public_vlan_id             = xxxxxxx
      + quote_id                   = xxxxxxx
      + resource_controller_url    = (known after apply)
      + resource_name              = (known after apply)
      + resource_status            = (known after apply)
      + secondary_ip_addresses     = (known after apply)
      + ssh_key_ids                = [
          + xxxxxxx,
          + xxxxxxx,
          + xxxxxxx,
        ]
      + wait_time_minutes          = 90
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_compute_vm_instance.virtual_server: Creating...
ibm_compute_vm_instance.virtual_server: Still creating... [10s elapsed]

Error: rpc error: code = Unavailable desc = transport is closing


Releasing state lock. This may take a few moments...
```

However, the same code, same steps. I am at least able to provision the server with the earlier binary for which I had raised the issues.